#  Pandas Tutorial

Agenda 

    What is Data Frame?
    what is Data Series?
    Operations in Pandas

In [1]:
 ## First step is to  import pandas and numpy

In [6]:
import pandas as pd
import numpy as np

In [7]:
## playing with dataframe

In [5]:
    df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [11]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [15]:
 # convert the dataframe to csv file

In [14]:
df.to_csv('Test1.csv')

In [16]:
## accessing the element
## 1 way.. loc 2.. iloc

In [10]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [21]:
 ## check the type

In [17]:
type(df.loc['Row1'])

pandas.core.series.Series

In [18]:
df.iloc[0:2:,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5

In [ ]:
 ## take the elements from column

In [19]:
df.iloc[0:2:,0:1]

      Column1
Row1        0
Row2        4

In [20]:
type(df.iloc[0:2:,0:1])

pandas.core.frame.DataFrame

In [22]:
 ## convert dataframe into array

In [23]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [25]:
df['Column1'].value_counts()

0     1
8     1
4     1
16    1
12    1
Name: Column1, dtype: int64